/*
 * =====================================================================================
 *
 *       Filename:  main6.c
 *
 *    Description:  
 *
 *        Version:  1.0
 *        Created:  2013年06月10日 15时51分39秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  guojun (jun_guo), jun_guo@dtri.com
 *        Company:  DT Research
 *
 * =====================================================================================
 */
/*======================================================================================
 *为什么第三输出不是11呢？因为sizeof是一个操作符，而不是一个函数，
 *在程序编译之前就已经完成了，所以sizeof(i++)就直接被4取代了，所以就
 *没有执行i++的操作了，所以就不会有11了。。
 *======================================================================================
 */
#include <stdio.h>
#include <stdlib.h>

int main(int argc, char **argv)
{
    int i = 10;

    printf("i:%d\n", i);
    printf("sizeof(i++):%d\n", sizeof(i++));
    printf("i++:%d\n", i++);

    return 0;
}









